/**********************************************
*File name:    one.c
*Description:   C程序设计(第五版)课后编程习题第1题
*Version：      1.0
*Author：       Robert
*Create Time:   2021-6-4
**********************************************/
#include <stdio.h>
#include <math.h>
//函数功能：用筛选法求100以内的所有素数。
/**************************************************************************************
筛选法的具体做法是：1.先将1挖掉(因为1不是素数). 
                  2.用下一个未被挖去的数p(也就是2)除p后面各数，把P的倍数挖掉。
                  3.检查P是否小于根号n的整数部分，如果是，则返回第二步，继续执行，否则就结束。
                  4.剩下的数就是素数了。
***************************************************************************************/
int main(void)
{
    int a[101], count;
    for (int i = 1; i < 101; i++) //给数组赋值，方便起见直接从1开始赋值
    {
        a[i] = i;
    }
    a[1] = 0;                           //把1挖掉
    for (int i = 2; i < sqrt(100); i++) //控制循环次数
    {
        for (int j = i + 1; j <= 100; j++) //将后面是i的倍数的数全部挖掉(即赋值为0)
        {
            if (a[i] != 0 && a[j] != 0)
            {
                if (a[j] % a[i] == 0)
                {
                    a[j] = 0;
                }
            }
        }
    }
    printf("用筛选法选出100以内的素数是：");
    for (int i = 1; i < 101; i++)
    {
        if (a[i] != 0)
        {
            printf("%3d", a[i]);
            count++;
        }
        if (count % 10 == 0)
        {
            printf("\n");
        }
    }
    return 0;
}