/**********************************************
*File name:     seven.c
*Description:   C程序设计(第五版)课后编程习题第7题
*Version：      1.0
*Author：       Robert
*Create Time:   2021-6-4
**********************************************/
#include <stdio.h>
//输出魔方阵
/*
魔方阵规律如下:1.将1放在第一行的中间一列。
              2.从2开始直到n*n止，各数依次排放规则是：每一个数存放的行比前一个数的行数减1，列数加1
              3.如果上一数的行数为1，则下一个数的行数为n(即最后一行)，列数同样加1
              4.当上一个数的列数为n，下一个数的列数为1，行数减1
              5.若按上面规则确定的位置上已有数，或上一个数是第1行第n列时，则把下一个数放在上一个数的下面。
*/
int main(void)
{
    int a[15][15], i, j, k, n;
    printf("请输入阶数为1~15的奇数:");
    scanf("%d", &n);
    while (1)
    {
        if ((n != 0) && (n <= 15) && (n % 2 != 0))
        {
            break;
        }
        else
        {
            printf("输入的数据不在合法范围内，请重新输入：\n");
        }
        scanf("%d", &n);
    }
    for (i = 1; i <= n; i++)     //初始化，赋值为0，为以后判断该位置上是否已有数
    {
        for (j = 1; j <= n; j++)
        {
            a[i][j] = 0;
        }
    }
    j = n / 2 + 1;             //求中间列
    a[1][j] = 1;               //将1放在第1行中间一列
    for (k = 2; k <= n * n; k++)   //建立魔方阵
    {
        i = i - 1;            //行数减1
        j = j + 1;            //列数加1
        if ((i < 1) && (j > n))
        {
            i=i+2;
            j=j-1;
        }
        else
        {
            if (i < 1)    //上一个数的行数为1时，下一个数的行数应为n
            {
                i = n;
            }
            if (j > n)    //上一个数的列数为n时，下一个数的列数应为1
            {
                j = 1;
            }
        }
        if (a[i][j] == 0)  //判断该位置上是否有数，然后按照规律放数
        {
            a[i][j] = k;
        }
        else
        {
            i += 2;
            j -= 1;
            a[i][j] = k;
        }
    }
    for (i = 1; i <= n; i++)       //输出魔方阵。
    {
        for (j = 1; j <= n; j++)
        {
            printf("%4d", a[i][j]);
        }
        printf("\n");
    }
    return 0;
}