/**********************************************
*File name:     thirteen.c
*Description:   C程序设计(第五版)课后编程习题第13题
*Version：      1.0
*Author：       Robert
*Create Time:   2021-6-4
**********************************************/
#include <stdio.h>
#include <math.h>
//函数功能：用迭代法求a的平方根.求平方根的迭代公式为：Xn+1=(Xn+a/Xn)/2
/*用迭代法求平方根的算法如下：
 1.设定一个x的初值X0(在以下程序中为方便起见设置为a/2,当然也可以是另外的值)
 2.用迭代公式求x的下一个值X1
 3.再将X1代入公式右侧的Xn，求出X的下一个值X2
 4.循环下去，直到前后两次求出的X值(Xn和Xn+1)满足Xn+1-Xn的绝对值小于10的-5次幂。
*/
int main(void)
{
    float a, x0, x1;
    printf("请输入待求平方根的的数：");
    scanf("%f", &a);
    x0 = a / 2;
    x1 = (x0 + a / x0) / 2;
    //如果此时X1-X0的绝对值大于等于10的-5次幂，就是X1成为新的X0，用新的X0求出下一个X1,如此反复，直到满足条件
    if (fabs(x1 - x0) >= 1e-5)
    {
        do
        {
            x0 = x1;
            x1 = (x0 + a / x0) / 2;
        } while (fabs(x1 - x0) >= 1e-5);
        printf("%.2f的平方根是%f\n", a, x1);
    }
    return 0;
}